app/views/home/_task_form.html.erb

SELECT "categories".* FROM "categories"
---
  <%= form.text_area :description, class: "terminal-task hidden", id: "terminal-task-description", placeholder: "Enter a task description" %>
  <%= form.collection_select :category_id, Category.all, :id, :name, {}, { class: "terminal-task hidden", id: "terminal-task-category" } %>