app/views/home/index.html.erb

    <%= form.label :category_id %>
    <%= form.collection_select :category_id, Category.all, :id, :name, prompt: "Select a category" %>
---
SELECT "categories".* FROM "categories"