app/controllers/categories_controller.rb

  def create
    @category = current_user.categories.build(category_params)
    if @category.save
---
INSERT INTO "categories" ("name", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Social"], ["created_at", "2024-02-23 08:06:55.069531"], ["updated_at", "2024-02-23 08:06:55.069531"], ["user_id", 1]]

  def set_category
    @category = current_user.categories.find(params[:id])
---
SELECT "categories".* FROM "categories" WHERE "categories"."user_id" = $1 AND "categories"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 5], ["LIMIT", 1]]