app/controllers/home_controller.rb

SELECT DISTINCT "tasks"."due_date" FROM "tasks" WHERE "tasks"."user_id" = $1  [["user_id", 1]]
---
  def index
    @categories = current_user.categories
    @tasks = current_user.tasks
    @due_dates = current_user.tasks.distinct.pluck(:due_date)