app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("name", "description", "due_date", "category_id", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @task = current_user.tasks.build(task_params)
    if @task.save